# # 4) შექმენით პითონის ფაილი და 4 ჯერ გამოიყენეთ print ფუნქცია, პირველ პრინტში გამოიყენეთ ორ რიცხვს შორის შეკრება +, მეორეში - გამოკლება, მესამეში * გამრავლება, მეოთხეში / გაყოფა

print(8 + 9)
print(15 - 14)
print(5 * 5)
print(9 / 33)

# #5) შეართეთ ორი ტექსტური მონაცემი და კომენტარებით ახსენით რა შედეგი მიიღეთ

print("nika" + "gogishvili")    # nika და gogishvili შევაერთე  + ით და შემდეგ print ფუნქიის საშუალებით დავბეჭდე



# # 6) დაუშვით ძალით შეცდომები და ნახეთ კომპიუტერი რას გამოგიტანთ შედეგად

# print(nika)   # print ფუნქციის შიგნით აკლია ბრჭყალები



# # 7) ყველა დაწერილი კოდი ახსენით კომენტარები + (დოკუმენტში კომენტარების ამოყენებით ქართული ენით ახსენით რა არის ტერმინალი და რისთვის ვიყენებთ)

# terminal-ში ვამოწმებთ ჩვენს დაწერილ კოდებს



# 8) შექმენით 2ცვლადი, შეინახეთ მასში რიცხვები და საბოლოოდ დაბეჭდეთ ამ ორ ცვლადს შორის რომელიმე არითმეტიკული მოქმედება

num1 = 90
num2 = 45
num3 = 45

print(num1 / num2)
print(num3 + num2)
print(num2 - num3)
print(num1 * num2)
print(num1 * num2 + num1 / num3)


# 9) ახსენით კომენტარებით რა არის სტრინგი და რა არის მთელი რიცხვი

# str-არის მონაცემთა ტიპი, რასაც ბრჭყალები აქვს ყველაფერი არის string
# მთელი რიცხვი არის integer-ის ტიპის int
