# 1. შექმენით ცვლადი რომელშიც შეინახავთ ნივთის ფასს. მეორე ცვლადში შეინახეთ ნივთის რაოდენობა.
# თქვენი დავალებაა, რომ დაბეჭდოთ, თუ რამდენი უნდა გადაიხადოთ ნივთების ყიდვისას (ფასი * რაოდენობა)

price = 45     # ვქმნით ცვლადს სახელად price და ვანიჭებთ მნიშვნელობას 45
quantity = 7   # ვქმნით ცვლადს სახელად quantity და ვანიჭებთ მნიშვნელობა 7 

print("price", price)   # ვბეჭდავთ ფასს
print("quantity", quantity)  #ვბეჭდავთ რაოდენობას
print("total" ,price * quantity)  #ვბეჭდავთ მთლიან ფასს




# 2. შექმენით ცვლადი, სადაც შეინახავთ თქვენს ასაკს. შემდეგ შექმენით მეორე ცვლადი,
# სადაც შეინახავთ ნებისმიერი ოჯახისწევრის ასაკს.თქვენი დავალებაა,
# რომ ჯერ დაბეჭდოთ თქვენს ასაკს + 10, შემდეგ ოჯახისწევრის ასაკს + 10.

my_age = 16  
sister_age = 9

print(my_age + 10)
print(sister_age + 10)




#  3. შექმენით ორი ცვლადი, თითოეულში შეინახეთ ნებისმიერი რიცხვი.
#  თქვენი დავალებაა, რომ არითმეტიკული მოქმედებების შედეგი დაბეჭდოთ ამ რიცხვებს შორის - ეს მოქმედებებია 
#  +, -, *, /

num1 = 9
num2 = 7

print(num1 + num2)
print(num2 - num1)
print(num1 * num2)
print(num2 / num1)
print(num1 * num2 + num2 / num1 - num2)




# 4. შექმენით ორი ცვლადი, პირველში თქვენი სახელი, ხოლო მეორეში ასაკი შეინახეთ.
# თქვენი დავალებაა, რომ ჯერ სახელი დაბეჭდოთ, შემდეგ კი ასაკი.

name = "nika"
my_age = 16

print("my name is" ,name)
print("my age is" ,my_age)




# 5. შექმენით ორი ცვლადი, პირველში შეინახეთ თქვენი ასაკი, ხოლო მეორეში შეინახეთ მშობლის ასაკი.
# დაბეჭდეთ, თუ 10 წელში რამდენჯერ მეტი იქნება მშობლის ასაკი თქვენსაზე

my_age = 16
my_parent_age = 41 

print(my_parent_age + 10 - my_age)

