# 1. მომხმარებელს შემოატანინეთ ჯერ სახელი, ხოლო შემდეგ გვარი.
#  ორივე მონაცემი შეინახეთ ცვლადებში და ბოლოს დაბეჭდეთ ერთი დიდი წინადადება,
#  რომელშიც გექნებათ სახელიც და გვარიც.

name = input("enter your name:")
surname = input("enter your surname:")

print("your name:" + name)
print("your surname:" + surname)



# 2. შექმენით ცვლადი, სადაც შეინახავთ თქვენთვის სასურველ რიცხვს.
#  შემდეგ შექმენით მეორე ცვლადი, სადაც მომხმარებელს შემოატანინებთ რიცხვს.
# თქვენი დავალებაა, რომ დაბეჭდოთ ამ ორი რიცხვის ჯამი.

num1 = 10
num2 = input("enter number:")

print(num1 + int(num2))
print(num1 * int(num2))
print(num1 - int(num2))
print(num1 / int(num2))
print(num1, "+", num2, "=", num1 + int(num2))


# 3. შექმენით სამი ცვლადი, თითოეულში შეინახეთ რიცხვი. თქვენი დავალებაა,
# რომ ამ სამი რიცხვის ჯამი გაყოთ მათ რაოდენობაზე და დაბეჭდოთ ეს შედეგი.

num1 = 9
num2 = 10
num3 = 11

print((num1 + num2 + num3) / 3)



# 4. პირველ რიგში, მომხმარებელს შემოატანინეთ სთრინგი და ის გაამრავლეთ ხუთზე.
# შემდეგ შემოატანინეთ რიცხვი და ისიც გაამრავლეთ ხუთზე.
# ორივე შედეგი დაბეჭდეთ და კომენტარების გამოყენებით აღწერეთ თითოეული.

num1 = input("enter something:")     # აქ უთითებენ სთრინგს
num2 = input("enter number:")       # აქ უთითებენ ნებისმიერ რიცხვს

print(num1 * 5)     # მომხმარებლის შემოტანილ სთრინგს ვამრავლებთ 5-ზე ანუ მომხმარებლის მიერ შემოტანილი სთრინგი განმეორდება 5 ჯერ
print(int(num2) * 5)    # მომხმარებლის შემოტანილ ნებისმიერ რიცხვს ვამრავლებთ 5-ზე, int არის მთელი რიცხვი და გამრავლდება ჩვოულებრივად 5-ზე



# 5. მომხმარებელს შემოატანინეთ ორი რიცხვი. თქვენი დავალებაა შექმნათ კალკულატორი, დაბეჭდეთ:
# რიცხვების ჯამი (num1 + num2), სხვაობა (num1 - num2), ნამრავლი (num1 * num2), განაყოფი (num1 / num2)

num1 = input("enter number:")
num2 = input("enter number:")

print(int(num1) + int(num2))
print(int(num1) - int(num2))
print(int(num1) * int(num2))
print(int(num1) / int(num2))


